[
    {
        "title": "Inter IIT 2K21 - Agrobot Design Innovation Challenge Winners",
        "image": "/images/agrobot.jpg",
        "description": "Our club members were the Gold Medalists in the Inter IIT 2021 Tech Meet - Agrobot Design Innovation Challenge. The challenge required innovative thinking for reducing the strenuous task of mountain agriculture in India due to the unevenness of land and arduous managing process through the use of bots. The framework of bots used on land for agriculture needs further applied advancement and fostered operations of its components. The Agrobot developed by our victorious team of students is a colossal step towards the future of Mountain Agriculture.",
        "participants": "Aditya Kumar Garg, P Govind Rao, Akshay Kumar Saunta, Inampudi Sai Amith, Satyam Modi",
        "brief": "Inter IIT 2K21 Tech Meet - Agrobot Design Innovation Challenge Winners"
    },
    {
        "title": "Team Vizhelp - 3rd Runner up in the Rakuten India Rakathon 2021",
        "image": "/images/Rakathon.jpeg",
        "description": "\"Team Vizhelp\" secured 3rd runner-up of Rakuten Rakathon 2021. This Rakathan was organized by Rakuten India.  Around 6000 teams submitted their idea as per the themes of Rakuten. Indian Institute of Technology (Indian School of Mines), Dhanbad's students “Team Vizhelp” was the youngest team in the final round with their idea for the development of smart AI-based solutions to help visually disabled people lead normal lives by assisting them in their day-to-day tasks and ultimately reducing their dependence on others.",
        "participants": "Aditya Kumar Garg, Priyansh Sharma, Pratham Pahariya, Ishal",
        "brief": "Team Vizhelp - 3rd Runner up in the Rakuten India Rakathon 2021"
    },
    {
        "title": "3rd Runner up in Honda Hackathon among 2361 teams",
        "image": "images/Drunk and Drowsiness Detector.png",
        "description": "When drowsy, people can’t react to stimuli in the environment. And thus, we test the response of driver as a measure of drowsiness. The voice assistant in the car asks for a verbal response at a frequency that’s neither too high as to disturb the driver nor too low to check if the driver is asleep. Alexa is triggered to ask questions depending upon the pattern of driving. The solution can be extended to even drivers with a little or no experience who otherwise create ruckus on street.",
        "participants": "Surya Prakash Mishra, Swaraj Jain, Harshit Gupta, Harsh Kumar Singh",
        "brief": "3rd Runner up in Honda Hackathon among 2361 teams"
    },
    {
        "title": "Tech Monks Startup",
        "image": "https://swaraj-jain.github.io/ROBOISM-Webpage/img/techmonk.png",
        "description": "Tech Monks Engineering Solutions LLP is a startup founded by the alumni of RoboISM. Their product 'Digital Punch Card' saves 20-25 days of time and work per design of saree, which was earlier required to build manual punch cards for sarees. Digital Punch Card is an electronic device which uses the saree's design in bitmap file and is more lasting than the manual one. The device future gives direction to the power loom machine for the weaving.",
        "participants": "Nitya Nand, Shanmukh Krishna Srikakolapu",
        "brief": "Tech Monks startup, provides new direction to the power loom machine for weaving"
    },
    {
        "title": "Team Navcharitam - KPMG Ideation Challenge 2020 Winners",
        "image": "https://swaraj-jain.github.io/ROBOISM-Webpage/img/KPMG.jpg",
        "description": "The Global KPMG Ideation Challenge 2020 saw participants from 18 countries, pitching their ideas regarding newer ways of work using Data Analytics and Artificial Intelligence. Our team, Team Navcharitam, from RoboISM emerged victorious as the Global Challenge with their disruptive innovation in the mining industry to enable safer and more sustainable extraction.",
        "participants": "Srajan Gupta, Parth Hetamsaria, Varnika Kumari, Sanchit Kumar",
        "brief": "Team Navcharitam - KPMG Ideation Challenge 2020 Winners - \"Disruptive Innovation\" in the Mining Industry"
    },
    {
        "title": "3rd Position in Hack Fest 2K19",
        "image": "https://swaraj-jain.github.io/ROBOISM-Webpage/img/p5.png",
        "description": "Our members developed a Self Balancing Bike. The bike could balance itself on it's wheels without the need for any external interaction. We emerged 3rd in Hackfest 2K19 for this project.",
        "participants": "Akhil Vaidya, Mayank Gupta, Sarthak Panda, Prerak Rawat, Subham",
        "brief": "3rd Position in Hackfest 2K18 - Self Balancing Bike"
    },
    {
        "title": "Inter IIT 2K18 (Bionic Leg) Winners",
        "image": "https://swaraj-jain.github.io/ROBOISM-Webpage/img/p1.png",
        "description": "Our club members represented IIT (ISM) Dhanbad in the Inter IIT 2K18 Tech Meet for developing a Bionic Leg. Bionic legs are artificial legs for disabled, that work by using signals from an individual's muscles to seamlessly move like the natural leg. Our team was declared the winners in the competition.",
        "participants": "Pragdheesh Rs, Eric John, Prince Kunal, Anshul Gupta",
        "brief": "Inter IIT 2K18 Tech Meet Winners For Bionic Leg"
    },
    {
        "title": "Inter IIT 2K18 (Ashoka's Tech For Change Challange) Winners",
        "image": "https://swaraj-jain.github.io/ROBOISM-Webpage/kps.png",
        "description": "Our club members represented IIT (ISM) Dhanbad in the Inter IIT 2K18 Tech Meet for Ashoka's Tech For Change Challange, and emerged victorious in the esteemed competition.",
        "participants": "Prakhar Kumar, Kapil Verma, Suyog jadhav",
        "brief": "Winners of Ashoka's Tech For Change Challange - Inter IIT Tech meet 2K18"
    },
    {
        "title": "3rd Position in Hackfest 2K18",
        "image": "https://swaraj-jain.github.io/ROBOISM-Webpage/img/p2.png",
        "description": "Our club members participated in the Hackfest 2K18 competition and developed IRis. It is a cheaper alternative to the current Audience Response Systems, by relying on IR instead of RF, WiFi or Bluetooth. We were given the 3rd prize for the development.",
        "participants": "Asutosh Rout, Neelesh Kumar Yadav, Nishad Mandlik, Sai Ruthvik, Sai Sumanth Kalluri",
        "brief": "3rd Position in Hackfest 2K18"
    },
    {
        "title": "3rd Position in Hackfest 2K17",
        "image": "https://swaraj-jain.github.io/ROBOISM-Webpage/img/p3.png",
        "description": "In Hackfest 2K17, we developed an autonomous vehicle, named ParaShoot which could detect human presence around military borders and eliminate any threats if necessary. Defense Research and Development Organization (DRDO) had developed an autonomous multi-terrain vehicle called Daksh, ich is capable of defusing bombs and neutralizing chemical weapons. ParaShoot was developed along the same lines. We emerged 3rd in the competition for ParaShoot.",
        "participants": "Asutosh Rout, Neelesh Kumar Yadav, Nishad Mandlik",
        "brief": "3rd Position in Hackfest 2K17"
    },
    {
        "title": "Top 10 in PanIIT Hackathon, Winner of SIH Internal Hackaton",
        "image": "https://swaraj-jain.github.io/ROBOISM-Webpage/img/p4.png",
        "description": "We developed an Epileptic Seizure Detection Device, which could ease the life of caretakers of patients suffering from Epilepsy. The device could be worn by the patient on the wrist, and would monitor the patient for seizures. In case of any detections, it would execute it's emergency procedures. For this, we emerged winners of SIH Internal Hackathon and were in the Top 10 in PanIIT Hackathon.",
        "participants": "Jyothi Swaroop K, Parth Khanna, Suddunuri Sandeep, Sreyans Bohara",
        "brief": "Top 10 in PanIIT Hackathon, Winner of SIH Internal Hackaton"
    }
]